B0weny-qwq/EmbedForge/examples/stm32f103-cmake-blink/Core/Inc/stm32f1xx_hal_conf.h
#ifndef __STM32F1xx_HAL_CONF_H
#define __STM32F1xx_HAL_CONF_H

#define HAL_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED

#define HSE_VALUE 8000000U
#define HSE_STARTUP_TIMEOUT 100U
#define LSE_STARTUP_TIMEOUT 5000U
#define LSE_VALUE 32768U
#define HSI_VALUE 8000000U
#define LSI_VALUE 40000U
#define VDD_VALUE 3300U
#define PREFETCH_ENABLE 1U
#define TICK_INT_PRIORITY 15U

#include "stm32f1xx_hal_rcc.h"
#include "stm32f1xx_hal_gpio.h"
#include "stm32f1xx_hal_cortex.h"
#include "stm32f1xx_hal_flash.h"
#include "stm32f1xx_hal_dma.h"
#include "stm32f1xx_hal_uart.h"

#define assert_param(expr) ((void)0U)

#endif
